[
  {
    "1": "Disease: Tomato_YellowLeaf_Curl_Virus\nPrecautions: Use virus-free seedlings, control whitefly populations, remove infected plants promptly.\nEnvironment: Favored by warm, dry climates and high whitefly populations.\nManagement: Practice crop rotation, use reflective mulches, apply insecticides strategically.\nCrop Rotation: Avoid rotating with solanaceous crops; use non-hosts like cereals.\nResistant Varieties: Use TYLCV-resistant varieties like ‘Tyking’, ‘Hawaii 7998’.\nPruning: Remove and destroy infected shoots/leaves early.\nChemical Control: Use systemic insecticides (e.g., Imidacloprid) to control whiteflies.\nSeed Treatment: Start with certified virus-free seeds/seedlings.\nIrrigation Timing: Morning irrigation helps reduce whitefly activity.\nFertilization: Balanced fertilization enhances plant resistance.\nMonitoring: Use yellow sticky traps to monitor whitefly activity.\nVentilation: Increase air circulation in greenhouses.\nFungicides: Not applicable, since it's a viral disease.\nWeed Control: Remove alternate hosts of whiteflies like weeds and ornamentals."
  },
  {
    "2": "Disease: Tomato_Bacterial_spot\nPrecautions: Avoid overhead irrigation, sanitize tools, and avoid field work when foliage is wet.\nEnvironment: High humidity and warm temperatures favor disease.\nManagement: Rotate crops, remove plant debris, copper sprays can reduce spread.\nCrop Rotation: Do not plant tomatoes or peppers for 2 years on the same field.\nResistant Varieties: Use resistant or tolerant varieties when available.\nPruning: Remove infected lower leaves as disease progresses.\nChemical Control: Apply copper-based bactericides with mancozeb.\nSeed Treatment: Hot water treatment and seed disinfectants help reduce seedborne transmission.\nIrrigation Timing: Drip irrigation is preferred; irrigate early in the day.\nFertilization: Avoid excessive nitrogen which promotes succulent growth.\nMonitoring: Look for small, water-soaked spots on leaves and fruits.\nVentilation: Ensure good airflow to reduce leaf wetness duration.\nFungicides: Fungicides are not effective; bactericides recommended.\nWeed Control: Remove nightshade and other Solanaceae weeds."
  },
  {
    "3": "Disease: Tomato_Late_blight\nPrecautions: Use certified seed, apply protectant fungicides before infection.\nEnvironment: Cool, wet, and humid conditions favor disease development.\nManagement: Remove infected plants, avoid overhead irrigation, rotate crops.\nCrop Rotation: Rotate with non-hosts like legumes or cereals for 2–3 years.\nResistant Varieties: Use late blight-resistant hybrids like ‘Mountain Magic’.\nPruning: Prune to improve airflow and reduce humidity.\nChemical Control: Use fungicides like chlorothalonil or metalaxyl in a preventive program.\nSeed Treatment: Start with disease-free transplants; not seedborne.\nIrrigation Timing: Irrigate in the morning to allow foliage to dry.\nFertilization: Maintain balanced NPK levels; avoid overwatering.\nMonitoring: Scout for brown-black lesions with white mold growth under humid conditions.\nVentilation: Essential in greenhouses to reduce relative humidity.\nFungicides: Use systemic + contact fungicides in rotation.\nWeed Control: Control volunteer potatoes and tomato plants."
  },
  {
    "4": "Disease: Tomato_Septoria_leaf_spot\nPrecautions: Avoid overhead irrigation, remove lower infected leaves, space plants properly.\nEnvironment: Favors humid, rainy weather with moderate temperatures.\nManagement: Crop rotation, fungicide sprays, debris destruction.\nCrop Rotation: Rotate with non-hosts like grains or legumes.\nResistant Varieties: Partial resistance in some cultivars.\nPruning: Remove lower leaves when first spots are visible.\nChemical Control: Use fungicides such as chlorothalonil or mancozeb.\nSeed Treatment: Use certified seed; seed not the primary source.\nIrrigation Timing: Water early and use drip irrigation to minimize leaf wetness.\nFertilization: Avoid nitrogen overuse; ensure balanced nutrients.\nMonitoring: Look for small, circular spots with dark margins and tan centers.\nVentilation: Ensure spacing for air flow to reduce humidity.\nFungicides: Apply protectant fungicides at first sign of disease.\nWeed Control: Eliminate weeds that harbor pathogens."
  },
  {
    "5": "Disease: Tomato_Spider_mites_Two_spotted_spider_mite\nPrecautions: Avoid water stress and monitor under hot, dry conditions.\nEnvironment: Thrives in hot, dry weather with dusty conditions.\nManagement: Use miticides, increase humidity, encourage predators like lady beetles.\nCrop Rotation: No direct benefit, but break mite cycles if possible.\nResistant Varieties: Few known; use vigorous cultivars that withstand stress.\nPruning: Remove infested leaves with visible webbing.\nChemical Control: Use miticides like abamectin or spiromesifen.\nSeed Treatment: Not applicable; pest not seed-transmitted.\nIrrigation Timing: Adequate irrigation reduces stress and mite outbreaks.\nFertilization: Avoid excess nitrogen which boosts mite reproduction.\nMonitoring: Inspect undersides of leaves for stippling and webbing.\nVentilation: Improve airflow to reduce dust and dryness.\nFungicides: Not used; mite-specific chemicals needed.\nWeed Control: Eliminate weeds which serve as alternate mite hosts."
  },
  {
    "6": "Disease: Tomato_Target_Spot\nPrecautions: Avoid overhead irrigation, use fungicides, remove infected leaves.\nEnvironment: Warm, humid environments with frequent rain.\nManagement: Rotate crops, use drip irrigation, fungicide protection.\nCrop Rotation: Avoid Solanaceae crops for 1–2 years.\nResistant Varieties: Limited availability; some tolerance in hybrids.\nPruning: Remove affected foliage to reduce spore spread.\nChemical Control: Use fungicides like chlorothalonil, azoxystrobin.\nSeed Treatment: Not required; disease not seedborne.\nIrrigation Timing: Water in the morning; avoid splashing.\nFertilization: Balanced nutrition strengthens plants.\nMonitoring: Look for concentric target-like lesions on leaves.\nVentilation: Increase airflow to lower leaf wetness duration.\nFungicides: Rotate fungicides with different modes of action.\nWeed Control: Destroy Solanaceae weeds nearby."
  },
  {
    "7": "Disease: Tomato_Early_blight\nPrecautions: Use certified seed, remove debris, practice sanitation.\nEnvironment: Warm, wet conditions promote disease.\nManagement: Crop rotation, fungicide applications, and staking plants.\nCrop Rotation: 3-year rotation with non-hosts recommended.\nResistant Varieties: Moderately resistant varieties available like 'Iron Lady'.\nPruning: Remove infected lower foliage.\nChemical Control: Use fungicides like mancozeb, azoxystrobin, or chlorothalonil.\nSeed Treatment: Seed treatment reduces early infections.\nIrrigation Timing: Water early; avoid wetting foliage.\nFertilization: Avoid over-fertilizing nitrogen.\nMonitoring: Monitor for concentric rings on lower leaves.\nVentilation: Space plants for better air flow.\nFungicides: Apply every 7–10 days under high pressure.\nWeed Control: Remove infected debris and solanaceous weeds."
  },
  {
    "8": "Disease: Potato_Early_blight\nPrecautions: Remove crop residues, use resistant varieties.\nEnvironment: High humidity and warm temperatures.\nManagement: Crop rotation, use of clean seed, regular fungicide spray.\nCrop Rotation: Avoid planting potatoes for 2–3 years.\nResistant Varieties: ‘Elba’, ‘Rosa’, and other tolerant lines.\nPruning: Not applicable; focus on removing infected debris.\nChemical Control: Apply fungicides like chlorothalonil and mancozeb.\nSeed Treatment: Treat seed potatoes with fungicides before planting.\nIrrigation Timing: Morning irrigation helps reduce leaf wetness.\nFertilization: Ensure adequate potassium and phosphorus.\nMonitoring: Check for dark, circular lesions with concentric rings.\nVentilation: Ensure good spacing in field to lower humidity.\nFungicides: Use protective sprays during susceptible stages.\nWeed Control: Remove infected plant debris and weeds."
  },
  {
    "9": "Disease: Potato_Late_blight\nPrecautions: Use certified seed, remove volunteer potatoes.\nEnvironment: Cool, wet, and humid weather.\nManagement: Fungicide rotation, debris removal, resistant cultivars.\nCrop Rotation: Avoid potatoes for 2–3 years; rotate with non-hosts.\nResistant Varieties: ‘Sarpo Mira’, ‘Valor’ are more tolerant.\nPruning: Not applicable; focus on removing entire infected plants.\nChemical Control: Use fungicides like metalaxyl and cyazofamid.\nSeed Treatment: Use clean seed; not seedborne directly.\nIrrigation Timing: Water during low humidity hours.\nFertilization: Balanced NPK to prevent stress.\nMonitoring: Scout for dark lesions with white mold growth under leaf.\nVentilation: Improve spacing for better airflow.\nFungicides: Use systemic and contact fungicides alternately.\nWeed Control: Control volunteers and host weeds."
  },
  {
    "10": "Disease: Pepper_bell_Bacterial_spot\nPrecautions: Avoid working when plants are wet, disinfect tools.\nEnvironment: Warm, humid climates with rainfall.\nManagement: Sanitation, copper sprays, resistant varieties.\nCrop Rotation: Do not plant peppers/tomatoes for 2 years.\nResistant Varieties: ‘Aristotle X3R’, ‘Declaration’.\nPruning: Remove lower leaves to prevent splash.\nChemical Control: Use copper with mancozeb or fixed copper compounds.\nSeed Treatment: Hot water seed treatment reduces transmission.\nIrrigation Timing: Water at base to avoid leaf wetting.\nFertilization: Avoid excessive nitrogen.\nMonitoring: Watch for leaf spots with yellow halo.\nVentilation: Good spacing for air flow.\nFungicides: Not effective; use bactericides.\nWeed Control: Remove nightshade and weed hosts."
  },
  {
    "11": "Disease: Tomato_Leaf_Mold\nPrecautions: Ensure proper spacing, avoid prolonged humidity.\nEnvironment: Cool, humid conditions in greenhouses.\nManagement: Use resistant varieties, apply fungicides, improve ventilation.\nCrop Rotation: 1–2 year break helps reduce spores.\nResistant Varieties: ‘Buffalo’, ‘Striker’.\nPruning: Remove lower, infected leaves regularly.\nChemical Control: Use fungicides like chlorothalonil, mancozeb.\nSeed Treatment: Not necessary unless seed saved from infected plants.\nIrrigation Timing: Avoid overhead irrigation.\nFertilization: Balanced nutrition to boost defense.\nMonitoring: Look for yellow spots turning brown on underside.\nVentilation: Key for greenhouse disease control.\nFungicides: Apply as soon as symptoms appear.\nWeed Control: Remove plant debris and weeds inside greenhouses."
  },
  {
    "12": "Disease: Tomato_mosaic_virus\nPrecautions: Avoid tobacco use around plants, disinfect tools.\nEnvironment: Stable in environment; spreads via contact.\nManagement: Sanitation is key; no cure after infection.\nCrop Rotation: Helps reduce infected residues.\nResistant Varieties: ‘Heinz 1439’, ‘Roma VF’.\nPruning: Remove infected plants promptly.\nChemical Control: No chemical control available.\nSeed Treatment: Hot water or TSP seed treatments.\nIrrigation Timing: Avoid contact irrigation systems.\nFertilization: Adequate nutrition supports tolerance.\nMonitoring: Check for mottled, mosaic leaf patterns.\nVentilation: Ensure air circulation to prevent spread.\nFungicides: Ineffective; virus management needed.\nWeed Control: Remove host weeds and sanitize area."
  }
]